from sympy.core.intfunc import mod_inverse

M = 64609769579611429997353694966383437261513111047091761154563552911357
E = 48065638707770555338831231217031917564303159626730871598644464074467
c = 39884319333375821769923105040126640733677785692045012810179363873377

p1 = 3754332193296326117620939071267839
p2 = 17209390712675232375433219312962563

phi_M = (p1 - 1) * (p2 - 1)
D = mod_inverse(E, phi_M)
message = pow(c, D, M)

alphabet = [
    " ",
    "а",
    "б",
    "в",
    "г",
    "д",
    "е",
    "ж",
    "з",
    "и",
    "й",
    "к",
    "л",
    "м",
    "н",
    "о",
    "п",
    "р",
    "с",
    "т",
    "у",
    "ф",
    "х",
    "ц",
    "ч",
    "ш",
    "щ",
    "ъ",
    "ы",
    "ь",
    "э",
    "ю",
    "я",
]

string = str(message)
result = []

for i in range(0, len(string), 2):
    letter = int(string[i : i + 2])
    result.append(alphabet[letter])

print("".join(result))
